# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
a1=pd.Series(np.random.randint(1,4,100))
a2=pd.Series(np.random.randint(1,3,100))
a3=pd.Series(np.random.randint(10000,30000,100))
print(a1,a2,a3)##整型

0     1
1     1
2     1
3     2
4     2
     ..
95    1
96    1
97    2
98    3
99    2
Length: 100, dtype: int32 0     1
1     1
2     1
3     2
4     1
     ..
95    2
96    1
97    1
98    1
99    1
Length: 100, dtype: int32 0     28344
1     11149
2     17062
3     22543
4     19985
      ...
95    18993
96    16188
97    28591
98    16398
99    26297
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
b=pd.concat([a1,a2,a3],axis=1)
b

    0  1      2
0   1  1  28344
1   1  1  11149
2   1  1  17062
3   2  2  22543
4   2  1  19985
.. .. ..    ...
95  1  2  18993
96  1  1  16188
97  2  1  28591
98  3  1  16398
99  2  1  26297

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [5]:
b.columns=['bedrs','bathrs','price_sqr_meter']
b

    bedrs  bathrs  price_sqr_meter
0       1       1            28344
1       1       1            11149
2       1       1            17062
3       2       2            22543
4       2       1            19985
..    ...     ...              ...
95      1       2            18993
96      1       1            16188
97      2       1            28591
98      3       1            16398
99      2       1            26297

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [7]:
bigcolumn=pd.concat([a1,a2,a3],axis=0)
pd.DataFrame(bigcolumn)

        0
0       1
1       1
2       1
3       2
4       2
..    ...
95  18993
96  16188
97  28591
98  16398
99  26297

[300 rows x 1 columns]

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [42]:
len(bigcolumn)

300

In [11]:
bigcolumn.index=[np.arange(300)]
pd.DataFrame(bigcolumn)
# bigcolumn.reset_index(drop=True,inplace=True)
# bigcolumn

         0
0        1
1        1
2        1
3        2
4        2
..     ...
295  18993
296  16188
297  28591
298  16398
299  26297

[300 rows x 1 columns]